//
//
//


//Заполните данными следующий кортеж:

    let date: [number, number?, number?];

    date = [15, 11,12];



/*
                    Необязательные элементы кортежей в TypeScript
Кортежи могут иметь необязательные элементы, для которых можно не задавать значение. Чтобы указать, что элемент является необязательным, после типа элемента ставится вопросительный знак.
Для примера в кортеже с юзером сделаем еще один необязательный элемент:

                    let user: [string, number, boolean?];

Давайте заполним наш кортеж, указав третий элемент:

                    user = ['john', 31, true];
А теперь заполним кортеж, опустив третий элемент:

                    user = ['john', 31];
 */
